gabrielcsiz/Obsidian_I8/Obsidian_I8.ioc
MMTAppReg8.MEMORYMAP.Size=65536
MMTAppReg8.MEMORYMAP.StartAddress=0x08000000
MMTAppRegionsCount=8
MMTConfigApplied=false
Mcu.CPN=STM32H7S7I8T6
Mcu.Context0=Boot
Mcu.Context1=Appli
Mcu.Context2=ExtMemLoader
Mcu.ContextNb=3
Mcu.Family=STM32H7
Mcu.IP0=CORTEX_M7_APPLI
Mcu.IP1=CORTEX_M7_BOOT
Mcu.IP10=GFXMMU
Mcu.IP11=GPU2D
Mcu.IP12=HPDMA1
Mcu.IP13=I2C1
Mcu.IP14=ICACHE_GPU2D
Mcu.IP15=JPEG
Mcu.IP16=LTDC
Mcu.IP17=MEMORYMAP
Mcu.IP18=NVIC2
Mcu.IP19=NVIC1
Mcu.IP2=CRC
Mcu.IP20=RCC
Mcu.IP21=SBS
Mcu.IP22=SDMMC1
Mcu.IP23=SYS
Mcu.IP24=USB_OTG_FS
Mcu.IP25=XSPI1
Mcu.IP26=XSPI2
Mcu.IP3=DEBUG
Mcu.IP4=DMA2D
Mcu.IP5=EXTMEM_MANAGER
Mcu.IP6=FDCAN1
Mcu.IP7=FDCAN2
Mcu.IP8=FLASH
Mcu.IP9=FREERTOS
Mcu.IPNb=27
Mcu.Name=STM32H7S7I8Tx
Mcu.Package=LQFP176
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN(OSC32_IN)
Mcu.Pin10=PH1-OSC_OUT(PH1)
Mcu.Pin100=VP_ICACHE_GPU2D_VS_ICACHE
Mcu.Pin101=VP_JPEG_VS_JPEG
Mcu.Pin102=VP_SBS_VS-SBS
Mcu.Pin103=VP_SYS_VS_tim6
Mcu.Pin104=VP_XSPI1_VS_octo
Mcu.Pin105=VP_XSPI2_VS_quad
Mcu.Pin106=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin107=VP_STMicroelectronics.X-CUBE-TOUCHGFX_App_VS_GraphicsJjApplication_4.24.2
Mcu.Pin11=PC0
Mcu.Pin12=PC2
Mcu.Pin13=PC3
Mcu.Pin14=PA0
Mcu.Pin15=PA1
Mcu.Pin16=PA2
Mcu.Pin17=PA3
Mcu.Pin18=PA5
Mcu.Pin19=PA6
Mcu.Pin2=PC15-OSC32_OUT(OSC32_OUT)
Mcu.Pin20=PA7
Mcu.Pin21=PC4
Mcu.Pin22=PC5
Mcu.Pin23=PB0
Mcu.Pin24=PB1
Mcu.Pin25=PB2
Mcu.Pin26=PF11
Mcu.Pin27=PE7
Mcu.Pin28=PP4
Mcu.Pin29=PP2
Mcu.Pin3=PE5
Mcu.Pin30=PP3
Mcu.Pin31=PO5
Mcu.Pin32=PO4
Mcu.Pin33=PP5
Mcu.Pin34=PP0
Mcu.Pin35=PP6
Mcu.Pin36=PO2
Mcu.Pin37=PP7
Mcu.Pin38=PP1
Mcu.Pin39=PO0
Mcu.Pin4=PF6
Mcu.Pin40=PB10
Mcu.Pin41=PB11
Mcu.Pin42=PB12
Mcu.Pin43=PB13
Mcu.Pin44=PB14
Mcu.Pin45=PB15
Mcu.Pin46=PN4
Mcu.Pin47=PN5
Mcu.Pin48=PN6
Mcu.Pin49=PN2
Mcu.Pin5=PF7
Mcu.Pin50=PN3
Mcu.Pin51=PN1
Mcu.Pin52=PC6
Mcu.Pin53=PC7
Mcu.Pin54=PC8
Mcu.Pin55=PC9
Mcu.Pin56=PA8
Mcu.Pin57=PA9
Mcu.Pin58=PA10
Mcu.Pin59=PA11
Mcu.Pin6=PF8
Mcu.Pin60=PA12
Mcu.Pin61=PA13(JTMS/SWDIO)
Mcu.Pin62=PA14(JTCK/SWCLK)
Mcu.Pin63=PA15(JTDI)
Mcu.Pin64=PC10
Mcu.Pin65=PC11
Mcu.Pin66=PC12
Mcu.Pin67=PD0
Mcu.Pin68=PD2
Mcu.Pin69=PE11
Mcu.Pin7=PF9
Mcu.Pin70=PE12
Mcu.Pin71=PE13
Mcu.Pin72=PE14
Mcu.Pin73=PD3
Mcu.Pin74=PG0
Mcu.Pin75=PG1
Mcu.Pin76=PM12
Mcu.Pin77=PM11
Mcu.Pin78=PM14
Mcu.Pin79=PD5
Mcu.Pin8=PF10
Mcu.Pin80=PG2
Mcu.Pin81=PF0
Mcu.Pin82=PB3(JTDO/TRACESWO)
Mcu.Pin83=PB4(NJTRST)
Mcu.Pin84=PB5
Mcu.Pin85=PE1
Mcu.Pin86=PE2
Mcu.Pin87=PB6
Mcu.Pin88=PB7
Mcu.Pin89=PB8
Mcu.Pin9=PH0-OSC_IN(PH0)
Mcu.Pin90=PB9
Mcu.Pin91=VP_CRC_VS_CRC
Mcu.Pin92=VP_DMA2D_VS_DMA2D
Mcu.Pin93=VP_EXTMEM_MANAGER_SIG_Activate_EXTMEM
Mcu.Pin94=VP_FLASH_SIG_Activate_FlashIP
Mcu.Pin95=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin96=VP_GFXMMU_VS_GFXMMU
Mcu.Pin97=VP_GPU2D_VS_GPU2D
Mcu.Pin98=VP_HPDMA1_VS_HPDMACH0
Mcu.Pin99=VP_HPDMA1_VS_HPDMACH1
Mcu.PinsNb=108
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-TOUCHGFX.4.24.2
Mcu.ThirdParty0_ContextShortName=App
Mcu.ThirdParty0_Instance=STMicroelectronics.X-CUBE-TOUCHGFX.4.24.2_App
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32H7S7I8Tx
MxCube.Version=6.13.0
MxDb.Version=DB.6.0.130
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.ForceEnableDMAVector=true
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC1.SysTick_IRQn=true\:15\:0\:false\:false\:true\:false\:true\:false
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC2.DMA2D_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC2.FDCAN1_IT0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.FDCAN1_IT1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.FDCAN2_IT0_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.FDCAN2_IT1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.ForceEnableDMAVector=true
NVIC2.GPU2D_ER_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC2.GPU2D_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC2.HPDMA1_Channel0_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC2.HPDMA1_Channel1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true\:true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC2.JPEG_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.LTDC_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true\:true
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC2.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false\:false
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC2.SavedPendsvIrqHandlerGenerated=true
NVIC2.SavedSvcallIrqHandlerGenerated=true
NVIC2.SavedSystickIrqHandlerGenerated=true
NVIC2.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true\:false
NVIC2.TIM6_IRQn=true\:15\:0\:false\:false\:true\:false\:false\:true\:true
NVIC2.TimeBase=TIM6_IRQn
NVIC2.TimeBaseIP=TIM6
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=RGB888
PA0.PinAttribute=Appli
PA0.Signal=LTDC_G3
PA1.Locked=true
PA1.Signal=UART4_RX
PA10.GPIOParameters=PinAttribute
PA10.Locked=true
PA10.Mode=RGB888
PA10.PinAttribute=Appli
PA10.Signal=LTDC_B4
PA11.GPIOParameters=PinAttribute
PA11.Locked=true
PA11.Mode=RGB888
PA11.PinAttribute=Appli
PA11.Signal=LTDC_B3
PA12.GPIOParameters=PinAttribute
PA12.Locked=true
PA12.Mode=FDCAN_Activate
PA12.PinAttribute=Appli
PA12.Signal=FDCAN1_TX
PA13(JTMS/SWDIO).Locked=true
PA13(JTMS/SWDIO).Mode=Trace_Asynchronous_SW
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14(JTCK/SWCLK).Locked=true
PA14(JTCK/SWCLK).Mode=Trace_Asynchronous_SW
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15(JTDI).GPIOParameters=PinAttribute
PA15(JTDI).Locked=true
PA15(JTDI).Mode=RGB888
PA15(JTDI).PinAttribute=Appli
PA15(JTDI).Signal=LTDC_R5
PA2.GPIOParameters=PinAttribute
PA2.Locked=true
PA2.Mode=RGB888
PA2.PinAttribute=Appli
PA2.Signal=LTDC_B7
PA3.GPIOParameters=PinAttribute
PA3.Locked=true
PA3.Mode=RGB888
PA3.PinAttribute=Appli
PA3.Signal=LTDC_DE
PA5.GPIOParameters=PinAttribute
PA5.Locked=true
PA5.Mode=RGB888
PA5.PinAttribute=Appli
PA5.Signal=LTDC_CLK
PA6.Locked=true
PA7.GPIOParameters=PinAttribute
PA7.Locked=true
PA7.Mode=RGB888
PA7.PinAttribute=Appli
PA7.Signal=LTDC_R4
PA8.GPIOParameters=PinAttribute
PA8.Locked=true
PA8.Mode=RGB888
PA8.PinAttribute=Appli
PA8.Signal=LTDC_B6
PA9.GPIOParameters=PinAttribute
PA9.Locked=true
PA9.Mode=RGB888
PA9.PinAttribute=Appli
PA9.Signal=LTDC_B5
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=DebugG
PB0.Locked=true
PB0.PinAttribute=Free
PB0.Signal=GPIO_Output
PB1.GPIOParameters=PinAttribute
PB1.Locked=true
PB1.Mode=RGB888
PB1.PinAttribute=Appli
PB1.Signal=LTDC_G2
PB10.GPIOParameters=PinAttribute
PB10.Locked=true
PB10.Mode=RGB888
PB10.PinAttribute=Appli
PB10.Signal=LTDC_G7
PB11.GPIOParameters=PinAttribute
PB11.Locked=true
PB11.Mode=RGB888
PB11.PinAttribute=Appli
PB11.Signal=LTDC_G6
PB12.GPIOParameters=PinAttribute
PB12.Locked=true
PB12.Mode=RGB888
PB12.PinAttribute=Appli
PB12.Signal=LTDC_G5
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=RGB888
PB13.PinAttribute=Appli
PB13.Signal=LTDC_G4
PB14.Locked=true
PB14.Signal=USART1_TX
PB15.Locked=true
PB15.Signal=USART1_RX
PB2.GPIOParameters=PinAttribute
PB2.Locked=true
PB2.Mode=RGB888
PB2.PinAttribute=Appli
PB2.Signal=LTDC_B2
PB3(JTDO/TRACESWO).Locked=true
PB3(JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
PB3(JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
PB4(NJTRST).GPIOParameters=PinAttribute
PB4(NJTRST).Locked=true
PB4(NJTRST).Mode=RGB888
PB4(NJTRST).PinAttribute=Appli
PB4(NJTRST).Signal=LTDC_R3
PB5.GPIOParameters=PinAttribute
PB5.Locked=true
PB5.Mode=FDCAN_Activate
PB5.PinAttribute=Appli
PB5.Signal=FDCAN2_RX
PB6.GPIOParameters=PinAttribute
PB6.Locked=true
PB6.Mode=FDCAN_Activate
PB6.PinAttribute=Appli
PB6.Signal=FDCAN2_TX
PB7.GPIOParameters=PinAttribute
PB7.Locked=true
PB7.Mode=I2C
PB7.PinAttribute=Appli
PB7.Signal=I2C1_SDA
PB8.GPIOParameters=PinAttribute
PB8.Locked=true
PB8.Mode=I2C
PB8.PinAttribute=Appli
PB8.Signal=I2C1_SCL
PB9.Locked=true
PB9.Signal=UART4_TX
PC0.GPIOParameters=GPIO_Label,PinAttribute
PC0.GPIO_Label=ILLUM
PC0.Locked=true
PC0.PinAttribute=Free
PC0.Signal=GPIO_Input
PC10.GPIOParameters=PinAttribute
PC10.Locked=true
PC10.Mode=SD_4_bits_Wide_bus
PC10.PinAttribute=Appli
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=PinAttribute
PC11.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PC11.PinAttribute=Appli
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=PinAttribute
PC12.Locked=true
PC12.Mode=SD_4_bits_Wide_bus
PC12.PinAttribute=Appli
PC12.Signal=SDMMC1_CK
PC13.GPIOParameters=GPIO_Label,PinAttribute
PC13.GPIO_Label=RF_SET
PC13.Locked=true
PC13.PinAttribute=Free
PC13.Signal=GPIO_Output
PC14-OSC32_IN(OSC32_IN).Mode=LSE-External-Oscillator
PC14-OSC32_IN(OSC32_IN).Signal=RCC_OSC32_IN
PC15-OSC32_OUT(OSC32_OUT).Mode=LSE-External-Oscillator
PC15-OSC32_OUT(OSC32_OUT).Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label,PinAttribute
PC2.GPIO_Label=LSO1
PC2.Locked=true
PC2.PinAttribute=Free
PC2.Signal=GPIO_Output
PC3.GPIOParameters=GPIO_Label,PinAttribute
PC3.GPIO_Label=LSO2
PC3.Locked=true
PC3.PinAttribute=Free
PC3.Signal=GPIO_Output
PC4.GPIOParameters=GPIO_Label,PinAttribute
PC4.GPIO_Label=HC_EN
PC4.Locked=true
PC4.PinAttribute=Free
PC4.Signal=GPIO_Output
PC5.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Label=HC_State
PC5.Locked=true
PC5.PinAttribute=Free
PC5.Signal=GPIO_Input
PC6.GPIOParameters=GPIO_Label,PinAttribute
PC6.GPIO_Label=DebugR
PC6.Locked=true
PC6.PinAttribute=Free
PC6.Signal=GPIO_Output
PC7.GPIOParameters=GPIO_Label,PinAttribute
PC7.GPIO_Label=DebugB
PC7.Locked=true
PC7.PinAttribute=Free
PC7.Signal=GPIO_Output
PC8.GPIOParameters=PinAttribute
PC8.Locked=true
PC8.Mode=SD_4_bits_Wide_bus
PC8.PinAttribute=Appli
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=PinAttribute
PC9.Locked=true
PC9.Mode=SD_4_bits_Wide_bus
PC9.PinAttribute=Appli
PC9.Signal=SDMMC1_D1
PD0.GPIOParameters=PinAttribute
PD0.Locked=true
PD0.Mode=FDCAN_Activate
PD0.PinAttribute=Appli
PD0.Signal=FDCAN1_RX
PD2.GPIOParameters=PinAttribute
PD2.Locked=true
PD2.Mode=SD_4_bits_Wide_bus
PD2.PinAttribute=Appli
PD2.Signal=SDMMC1_CMD
PD3.GPIOParameters=PinAttribute
PD3.Locked=true
PD3.Mode=RGB888
PD3.PinAttribute=Appli
PD3.Signal=LTDC_B1
PD5.GPIOParameters=GPIO_Label,PinAttribute
PD5.GPIO_Label=BL_CTRL
PD5.Locked=true
PD5.PinAttribute=Free
PD5.Signal=GPIO_Output
PE1.GPIOParameters=GPIO_Label,PinAttribute
PE1.GPIO_Label=RF_CS
PE1.Locked=true
PE1.PinAttribute=Free
PE1.Signal=GPIO_Output
PE11.GPIOParameters=PinAttribute
PE11.Locked=true
PE11.Mode=RGB888
PE11.PinAttribute=Appli
PE11.Signal=LTDC_VSYNC
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE12.GPIO_Label=CAN1_STBY
PE12.Locked=true
PE12.PinAttribute=Free
PE12.Signal=GPIO_Output
PE13.GPIOParameters=GPIO_Label,PinAttribute
PE13.GPIO_Label=LCD_INT
PE13.Locked=true
PE13.PinAttribute=Free
PE13.Signal=GPIO_Output
PE14.GPIOParameters=GPIO_Label,PinAttribute
PE14.GPIO_Label=LCD_INT
PE14.Locked=true
PE14.PinAttribute=Free
PE14.Signal=GPXTI14
PE2.GPIOParameters=GPIO_Label,PinAttribute
PE2.GPIO_Label=CAN2_STBY
PE2.Locked=true
PE2.PinAttribute=Free
PE2.Signal=GPIO_Output
PE5.GPIOParameters=GPIO_Label,PinAttribute
PE5.GPIO_Label=SDMMC_CD
PE5.Locked=true
PE5.PinAttribute=Free
PE5.Signal=GPIO_Input
PE7.GPIOParameters=GPIO_Label,PinAttribute
PE7.GPIO_Label=Buzz
PE7.Locked=true
PE7.PinAttribute=Free
PE7.Signal=GPIO_Output
PF0.GPIOParameters=PinAttribute
PF0.Locked=true
PF0.Mode=RGB888
PF0.PinAttribute=Appli
PF0.Signal=LTDC_R2
PF10.GPIOParameters=PinAttribute
PF10.Locked=true
PF10.Mode=RGB888
PF10.PinAttribute=Appli
PF10.Signal=LTDC_R1
PF11.GPIOParameters=PinAttribute
PF11.Locked=true
PF11.Mode=RGB888
PF11.PinAttribute=Appli
PF11.Signal=LTDC_B0
PF6.GPIOParameters=GPIO_Label,PinAttribute
PF6.GPIO_Label=LTDC_DISP
PF6.Locked=true
PF6.PinAttribute=Free
PF6.Signal=GPIO_Output
PF7.GPIOParameters=PinAttribute
PF7.Locked=true
PF7.Mode=RGB888
PF7.PinAttribute=Appli
PF7.Signal=LTDC_G0
PF8.GPIOParameters=PinAttribute
PF8.Locked=true
PF8.Mode=RGB888
PF8.PinAttribute=Appli
PF8.Signal=LTDC_G1
PF9.GPIOParameters=PinAttribute
PF9.Locked=true
PF9.Mode=RGB888
PF9.PinAttribute=Appli
PF9.Signal=LTDC_R0
PG0.GPIOParameters=PinAttribute
PG0.Locked=true
PG0.Mode=RGB888
PG0.PinAttribute=Appli
PG0.Signal=LTDC_R7
PG1.GPIOParameters=PinAttribute
PG1.Locked=true
PG1.Mode=RGB888
PG1.PinAttribute=Appli
PG1.Signal=LTDC_R6
PG2.GPIOParameters=PinAttribute
PG2.Locked=true
PG2.Mode=RGB888
PG2.PinAttribute=Appli
PG2.Signal=LTDC_HSYNC
PH0-OSC_IN(PH0).Locked=true
PH0-OSC_IN(PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN(PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT(PH1).Locked=true
PH1-OSC_OUT(PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT(PH1).Signal=RCC_OSC_OUT
PM11.GPIOParameters=PinAttribute
PM11.Locked=true
PM11.Mode=Device_Only
PM11.PinAttribute=Appli
PM11.Signal=USB_OTG_FS_DP
PM12.GPIOParameters=PinAttribute
PM12.Locked=true
PM12.Mode=Device_Only
PM12.PinAttribute=Appli
PM12.Signal=USB_OTG_FS_DM
PM14.GPIOParameters=PinAttribute
PM14.Locked=true
PM14.Mode=Activate_VBUS
PM14.PinAttribute=Appli
PM14.Signal=USB_OTG_FS_VBUS
PN1.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN1.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN1.Locked=true
PN1.Mode=XSPI2_NCS1_Port2
PN1.PinAttribute=Boot
PN1.Signal=XSPIM_P2_NCS1
PN2.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN2.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN2.Locked=true
PN2.Mode=XSPI2_Port2Quad
PN2.PinAttribute=Boot
PN2.Signal=XSPIM_P2_IO0
PN3.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN3.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN3.Locked=true
PN3.Mode=XSPI2_Port2Quad
PN3.PinAttribute=Boot
PN3.Signal=XSPIM_P2_IO1
PN4.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN4.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN4.Locked=true
PN4.Mode=XSPI2_Port2Quad
PN4.PinAttribute=Boot
PN4.Signal=XSPIM_P2_IO2
PN5.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN5.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN5.Locked=true
PN5.Mode=XSPI2_Port2Quad
PN5.PinAttribute=Boot
PN5.Signal=XSPIM_P2_IO3
PN6.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PN6.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PN6.Locked=true
PN6.Mode=XSPI2_Port2Quad
PN6.PinAttribute=Boot
PN6.Signal=XSPIM_P2_CLK
PO0.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PO0.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PO0.Locked=true
PO0.Mode=XSPI1_NCS1_Port1
PO0.PinAttribute=Boot
PO0.Signal=XSPIM_P1_NCS1
PO2.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PO2.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PO2.Locked=true
PO2.Mode=XSPI1_Port1Octo
PO2.PinAttribute=Boot
PO2.Signal=XSPIM_P1_DQS0
PO4.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PO4.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PO4.Locked=true
PO4.Mode=XSPI1_Port1Octo
PO4.PinAttribute=Boot
PO4.Signal=XSPIM_P1_CLK
PO5.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PO5.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PO5.Locked=true
PO5.Mode=XSPI1_Port1_NCLK
PO5.PinAttribute=Boot
PO5.Signal=XSPIM_P1_NCLK
PP0.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP0.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP0.Locked=true
PP0.Mode=XSPI1_Port1Octo
PP0.PinAttribute=Boot
PP0.Signal=XSPIM_P1_IO0
PP1.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP1.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP1.Locked=true
PP1.Mode=XSPI1_Port1Octo
PP1.PinAttribute=Boot
PP1.Signal=XSPIM_P1_IO1
PP2.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP2.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP2.Locked=true
PP2.Mode=XSPI1_Port1Octo
PP2.PinAttribute=Boot
PP2.Signal=XSPIM_P1_IO2
PP3.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP3.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP3.Locked=true
PP3.Mode=XSPI1_Port1Octo
PP3.PinAttribute=Boot
PP3.Signal=XSPIM_P1_IO3
PP4.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP4.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP4.Locked=true
PP4.Mode=XSPI1_Port1Octo
PP4.PinAttribute=Boot
PP4.Signal=XSPIM_P1_IO4
PP5.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP5.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP5.Locked=true
PP5.Mode=XSPI1_Port1Octo
PP5.PinAttribute=Boot
PP5.Signal=XSPIM_P1_IO5
PP6.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP6.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP6.Locked=true
PP6.Mode=XSPI1_Port1Octo
PP6.PinAttribute=Boot
PP6.Signal=XSPIM_P1_IO6
PP7.GPIOParameters=GPIO_Speed_Very_High_Default,PinAttribute
PP7.GPIO_Speed_Very_High_Default=GPIO_SPEED_FREQ_MEDIUM
PP7.Locked=true
PP7.Mode=XSPI1_Port1Octo
PP7.PinAttribute=Boot
PP7.Signal=XSPIM_P1_IO7
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H7S7I8Tx
ProjectManager.FirmwarePackage=STM32Cube FW_H7RS V1.1.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=App-0x200,Boot-0x200,ExtMemLoader-0x200
ProjectManager.KeepUserCode=true
